package com.yatang.sc.common.staticvalue;

/**
 * @描述: 公共枚举类定义.
 * @作者: lvheping
 * @创建时间: 2017年8月31日-下午16:21:42 .
 * @版本: 1.0 .
 */

public enum CommonsEnum {
    /**
     * 请求成功
     */
    RESPONSE_200("200", "请求成功"),
    /**
     * 服务器错误
     */
    RESPONSE_500("500", "服务器错误"),

    /**
     * 接口错误
     */
    RESPONSE_5001("5001", "服务器异常"),

    /**
     * 请求参数有误
     */
    RESPONSE_400("400", "请求参数有误"),
    /**
     * 用户未登录
     */
    RESPONSE_401("401", "用户未登录"),
    /**
     * 业务逻辑错误响应码
     */
    RESPONSE_402("402", "业务逻辑错误响应码"),
    /**
     * 用户未授权
     */
    RESPONSE_403("500", "用户未授权"),
    /**
     * 用户名密码错误
     */
    RESPONSE_506("506", "用户名密码错误"),
    /**
     * 用户被禁用
     */
    RESPONSE_507("507", "用户被禁用"),
    /**
     * 用户不存在
     */
    RESPONSE_508("508", "用户不存在"),
    /**
     * 原密码错误
     */
    RESPONSE_509("509", "原密码错误"),
    /**
     * 供应商已创建用户
     */
    RESPONSE_510("510", "供应商已创建用户"),
    /**
     * 用户已存在
     */
    RESPONSE_10000("10000", "用户已存在"),
    /**
     * 序号重复
     */
    RESPONSE_10001("10001", "序号重复"),
    /**
     * 网关超时
     */
    RESPONSE_504("504", "网关超时"),
    /**
     * 当前页
     */
    RESPONSE_PAGE_NUM("1", "当前页"),
    /**
     * 当前页显示记录数
     */
    RESPONSE_PAGE_SIZE("20", "当前页显示记录数"),

    /**************************
     * 定义图片上传响应码--start
     ***********************************/
    /**
     * 上传失败，上传图片数据为空
     */
    RESPONSE_10003("10003", "上传失败，上传图片数据为空"),
    /**
     * 上传失败，数据不合法
     */
    RESPONSE_10004("10004", "上传失败，数据不合法"),
    /**
     * 上传图片格式不合法
     */
    RESPONSE_10005("10005", "上传图片格式不合法"),
    /**************************
     * 定义图片上传响应码--end
     ***********************************/
    /**
     * 查询结果不存在或返回空(空指针异常处理)
     */
    RESPONSE_10006("10006", "记录不存在"),

    /**************************** 定义供应商基本的响应码--start ************************/
    /**
     * 公司编号重复
     */
    RESPONSE_10007("10007", "公司名称重复"),
    /**
     * 供应商编号重复
     */
    RESPONSE_10008("10008", "供应商编号重复"),
    /**
     * 供应商注册号重复
     */
    RESPONSE_10009("10009", "供应商注册号重复"),
    /**
     * 供应商主账号重复
     */
    RESPONSE_10010("10010", "供应商主账号重复"),
    /**
     * 纳税人识别码重复
     */
    RESPONSE_10011("10011", "纳税人识别码重复"),
    /**
     * 银行账号重复
     */
    RESPONSE_10012("10012", "银行账号重复"),
    /**
     * 营业执照存号重复
     */
    RESPONSE_10013("10013", "营业执照号重复"),
    /**
     * 组织机构代码重复
     */
    RESPONSE_10014("10014", "组织机构代码重复"),

    /**
     * 紧急联系人联系电话重复
     */
    RESPONSE_10015("10015", "紧急联系人联系电话重复"),
    /**
     * 紧急联系人公司电话重复
     */
    RESPONSE_10016("10016", "紧急联系人公司电话重复"),
    /**
     * 入驻联系人电话重复
     */
    RESPONSE_10017("10017", "入驻联系人电话重复"),
    /**
     * 入驻联系人邮箱重复
     */
    RESPONSE_10018("10018", "入驻联系人邮箱重复"),
    /**
     * 正常状态的供应商已存在
     */
    RESPONSE_10019("10019", "正常状态的供应商已存在"),

    /**************************** 定义供应商基本的响应码--end ************************/
    /**
     * 数据没有被更新
     */
    RESPONSE_10020("10020", "数据没有被更新"),
    /**
     * 主键没有传递,更新失败
     */
    RESPONSE_10021("10021", "主键没有传递,更新失败"),

    /**
     * 主键没有传递,更新失败
     */
    RESPONSE_10022("10022", "后台运行异常检查传入审核参数是否符合规范"),
    
    RESPONSE_10023("10023", "该商品在该子公司已有配置销售信息"),

    /**
     * 更新失败
     */
    RESPONSE_10024("10024", "更新失败"),
    /**
     * 插入失败
     */
    RESPONSE_10025("10025", "插入失败"),
    /**
     * 删除操作失败
     */
    RESPONSE_10026("10026", "删除操作失败"),
    /**
     * 没有可处理的商品id
     */
    RESPONSE_10027("10027", "没有可处理的商品id"),

    /**
     * 采购内装数必须是默认箱规的整数倍
     */
    RESPONSE_10028("10028", "采购内装数必须是默认箱规的整数倍"),
    /**
     * 商品的默认箱规的为零
     */
    RESPONSE_10029("10029", "商品的默认箱规的为零"),
    /**
     * 流水号生成失败
     */
    RESPONSE_10030("10030", "流水号生成失败"),

    /**
     * 订单校验失败
     */
    RESPONSE_10031("10031", "订单校验失败"),
    /**
     * 供应商地址发生改变
     */
    RESPONSE_10032("10032", "供应商地址已发生改变"),
    /**
     * 供应商状态异常
     */
    RESPONSE_10033("10033", "供应商状态异常"),
    /**
     * 条形码的URL插入失败
     */
    RESPONSE_10034("10034", "条形码的URL插入失败"),
    /**
     * 供应商地点编号重复
     */
    RESPONSE_10035("10035", "供应商地点编号重复"),

    /**
     * 热搜参数字数超过5个
     */
    RESPONSE_10036("10036", "参数字数超过5个"),

    /**
     * 该参数已存在，请重新填写
     */
    RESPONSE_10037("10037", "该参数已存在，请重新填写"),

    /**
     * 请输入必填字段
     */
    RESPONSE_10038("10038", "请输入必填字段"),
    /**
     * 请输入必填字段
     */
    RESPONSE_10039("10039", "查询门店信息为空"),

    /**************************促销活动枚举--start***********************************/
    /**
     * 促销活动编码初始值
     */
    PROMO_CONF_VAL("10040", "10001"),
    /**************************供应商类型枚举--end***********************************/

    /*************************库存调整--start*************************************/

    //响应码: 库存调整响应码调整 20001开始 预计20001到 20050

    RESPONSE_20001("20001", "库存调整失败"),
    RESPONSE_20002("20002", "分公司查不合法"),
    RESPONSE_20003("20003", "warehouseCode不合法"),
    RESPONSE_20004("20004", "orderCode不合法"),
    RESPONSE_20005("20005", "商品不存在"),
    RESPONSE_20006("20006", "查询际链接口失败"),
    RESPONSE_20007("20007", "查询仓库信息失败"),
    RESPONSE_20008("20008", "际链传递调整单类型出错"),
    RESPONSE_20009("20009", "际链传递调整单数据为空值"),
    RESPONSE_20010("20010", "际链传递调整单存在商品编号为空的数据"),
    RESPONSE_20011("20011", "际链传递调整单存在商品调整数量为0"),
    /*************************库存调整--end*************************************/

    /*****************************库存相关响应吗***************************************/
    // 响应码: 库存调整响应码调整 20051开始 预计20050  到 20100
    RESPONSE_20051("20051", "销售订单取消失败"),
    RESPONSE_20052("20052", "销售单新增失败"),

    /*****************************出入库类型--start***************************************/
    // 采购入库
    RESPONSE_20060("20060", "PAS"),
    // 采购退货出库
    RESPONSE_20061("20061", "PR"),
    RESPONSE_20062("20062", "销售出库"),
    RESPONSE_20063("20063", "销售退货入库"),

    /*****************************出入库类型--end***************************************/

    /*********************************************************************/

    /*****************************退换货单--start***************************************/

    // 响应码: 退换货单 20101开始 预计20101  到 20130

    RESPONSE_20101("20101", "获取订单信息失败"),
    RESPONSE_20102("20102", "新增退货单失败"),
    RESPONSE_20103("20103", "商品退换货数量大于实际可退换货数量"),
    RESPONSE_20104("20104", "退换货类型校验失败,不满足退换货类型"),
    RESPONSE_20105("20105", "当前退换货单不能进行退换货操作"),
    RESPONSE_20106("20106", "当前单据操作失败"),
    RESPONSE_20107("20107", "当前单据状态不可执行单据操作"),
    RESPONSE_20108("20108", "更新订单上的退换货数量失败"),
    RESPONSE_20109("20109", "调用退换货单操作失败"),
    RESPONSE_20110("20110", "退换货单保存失败"),
    RESPONSE_20111("20111", "退换货单更新确认状态失败"),
    RESPONSE_20112("20112", "退换货单更新完成状态失败"),
    RESPONSE_20113("20113", "换货单更新传输状态状态"),
    RESPONSE_20114("20114", "当前订单状态未完成,不能申请退换货操作"),
    RESPONSE_20115("20115", "当前退货单状态已完成,不能再执行完成操作"),
    RESPONSE_20116("20116", "当前换货单状态,不能再执行完成操作"),
    RESPONSE_20117("20117", "当前单据不存在,请核实"),
    RESPONSE_20118("20118", "当前单据类型不支持退换货请求"),
    RESPONSE_20119("20119", "当前单据类型完成时间为空不能执行退换货退换货操作"),
    RESPONSE_20120("20120", "当前单据类型完成时间超过7天的期限，不能执行退换货操作"),
    RESPONSE_20121("20121", "当前单据类型为正常退货,暂只支持直营店退货"),
    RESPONSE_20122("20122", "当前单据类型为正常退货拒绝,暂只支持直营店退货"),
    RESPONSE_20123("20123", "退货单取消失败"),
    RESPONSE_20124("20124", "销售单第三方调用创建失败"),
    RESPONSE_20125("20125", "销售单退货库存调整失败"),
    RESPONSE_20126("20126", "销售单创建发货单失败"),

    RESPONSE_20127("20127", "拒收退款记录已经存在"),
    /*****************************退换货单--end***************************************/

    /*****************************促销管理--start***************************************/
    RESPONSE_20200("20200", "作废操作成功！"),
    RESPONSE_20201("20201", "作废操作失败，请检查优惠券是否被使用！"),
    /*****************************促销管理--end***************************************/

    /*****************************单据类型--start***************************************/
    RESPONSE_20300("20300", "普通采购订单"),
    RESPONSE_20301("20301", "促销釆购订单"),
    RESPONSE_20302("20302", "赠品采购订单"),
    RESPONSE_20303("20303", "采购退货单"),
    // 采购订单
    RESPONSE_20304("20304", "CGDD"),
    // 采购退货
    RESPONSE_20305("20305", "CGTH"),
    /*****************************单据类型--end***************************************/

    /*****************************采购收货--start***************************************/
    RESPONSE_20400("20400", "已经收货的收货单，不再重复收货"),

    /*****************************采购收货--end***************************************/

    RESPONSE_20023("20023","查无此仓库信息"),
    RESPONSE_20024("20024","文件不存在"),
    RESPONSE_10047("10047", "上传了一个空文件,请添加数据"),
    RESPONSE_10048("10048", "文件格式错误"),
    RESPONSE_10049("10049", "已经预定过的商品"),
    RESPONSE_50011("50011","区域组已经存在");


    
    CommonsEnum(String code, String name) {
        this.code = code;
        this.name = name;
    }

    private String code;
    private String name;


    public String getCode() {
        return code;
    }


    public void setCode(String code) {
        this.code = code;
    }


    public String getName() {
        return name;
    }


    public void setName(String name) {
        this.name = name;
    }
}
