package com.yatang.sc.payment.common;

/**
 * @描述: 公共枚举类定义.
 * @作者: huangjianjun
 * @创建时间: 2017年5月19日-下午9:42:42 .
 * @版本: 1.0 .
 */

public enum CommonsEnum {
    /**
     * 请求成功
     */
    RESPONSE_200("200", "请求成功"),
    /**
     * 服务器错误
     */
    RESPONSE_500("500", "服务器错误"),
    /**
     * 请求参数有误
     */
    RESPONSE_400("400", "请求参数有误"),
    /**
     * 用户未登录
     */
    RESPONSE_401("401", "用户未登录"),
    /**
     * 业务逻辑错误响应码
     */
    RESPONSE_402("402", "业务逻辑错误响应码"),
    /**
     * 用户已存在
     */
    RESPONSE_10000("10000", "用户已存在"),
    /**
     * 序号重复
     */
    RESPONSE_10001("10001", "序号重复"),
    /**
     * 网关超时
     */
    RESPONSE_504("504", "网关超时"),
    /**
     * 当前页
     */
    RESPONSE_PAGE_NUM("1", "当前页"),
    /**
     * 当前页显示记录数
     */
    RESPONSE_PAGE_SIZE("20", "当前页显示记录数"),


    /**************************定义图片上传响应码--start***********************************/
    /**
     * 上传失败，上传图片数据为空
     */
    RESPONSE_10003("10003", "上传失败，上传图片数据为空"),
    /**
     * 上传失败，数据不合法
     */
    RESPONSE_10004("10004", "上传失败，数据不合法"),
    /**
     * 上传图片格式不合法
     */
    RESPONSE_10005("10005", "上传图片格式不合法"),
    /**************************定义图片上传响应码--end***********************************/
    /**
     * 查询结果不存在或返回空(空指针异常处理)
     */
    RESPONSE_10006("10006", "记录不存在"),

    /****************************定义供应商基本的响应码--start************************/
    /**
     * 公司编号重复
     */
    RESPONSE_10007("10007", "公司名称重复"),
    /**
     * 供应商编号重复
     */
    RESPONSE_10008("10008", "供应商编号重复"),
    /**
     * 供应商注册号重复
     */
    RESPONSE_10009("10009", "供应商注册号重复"),
    /**
     * 供应商主账号重复
     */
    RESPONSE_10010("10010", "供应商主账号重复"),
    /**
     * 纳税人识别码重复
     */
    RESPONSE_10011("10011", "纳税人识别码重复"),
    /**
     * 银行账号重复
     */
    RESPONSE_10012("10012", "银行账号重复"),
    /**
     * 营业执照存号重复
     */
    RESPONSE_10013("10013", "营业执照存号重"),
    /**
     * 组织机构代码重复
     */
    RESPONSE_10014("10014", "组织机构代码重复"),

    /**
     * 紧急联系人联系电话重复
     */
    RESPONSE_10015("10015", "紧急联系人联系电话重复"),
    /**
     * 紧急联系人公司电话重复
     */
    RESPONSE_10016("10016", "紧急联系人公司电话重复"),
    /**
     * 入驻联系人电话重复
     */
    RESPONSE_10017("10017", "入驻联系人电话重复"),
    /**
     * 入驻联系人邮箱重复
     */
    RESPONSE_10018("10018", "入驻联系人邮箱重复"),
    /**
     * 正常状态的供应商已存在
     */
    RESPONSE_10019("10019", "正常状态的供应商已存在"),
    /****************************定义供应商基本的响应码--end************************/
    /**
     * 数据没有被更新
     */
    RESPONSE_10020("10020", "数据没有被更新"),
    /**
     * 主键没有传递,更新失败
     */
    RESPONSE_10021("10021", "主键没有传递,更新失败"),

    /*****************************定义支付基本响应码******************************************/

    PAY_ORDER_NONE_EXIST("p10001", "支付订单不存在"),

    VALIDATION_SIGN_FAIL("p10002", "支付验签失败"),
    DUPLICATION_REQUEST("p10003", "重复的接口请求"),
    PAY_CONFIG_NONE_EXIST("p10004", "支付配置信息错误"),
    REFUND_RECORD_NONE_EXIST("p10005", "退款记录不存在"),
    REFUND_STATUS_INVALID("p10006", "退款状态不正确");


    CommonsEnum(String code, String name) {
        this.code = code;
        this.name = name;
    }

    private String code;
    private String name;

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public String getName() {
        return name;
    }

    public void setName(String name) {
        this.name = name;
    }
}
