package com.yatang.sc.facade.common;

/**
 * @描述: 公共枚举类定义.
 * @作者: huangjianjun
 * @创建时间: 2017年5月19日-下午9:42:42 .
 * @版本: 1.0 .
 */

public enum CommonsEnum {
	/**
	 * 请求成功
	 */
	RESPONSE_200("200", "请求成功"),
	/**
	 * 服务器错误
	 */
	RESPONSE_500("500", "服务器错误"),

	/**
	 * 接口错误
	 */
	RESPONSE_5001("5001", "服务器异常"),

	/**
	 * 请求参数有误
	 */
	RESPONSE_400("400", "请求参数有误"),
	/**
	 * 用户未登录
	 */
	RESPONSE_401("401", "用户未登录"),
	/**
	 * 业务逻辑错误响应码
	 */
	RESPONSE_402("402", "业务逻辑错误响应码"),
	/**
	 * 用户未授权
	 */
	RESPONSE_403("403", "用户未授权"),
	/**
	 * 用户已存在
	 */
	RESPONSE_10000("10000", "用户已存在"),
	/**
	 * 序号重复
	 */
	RESPONSE_10001("10001", "序号重复"),
	/**
	 * 网关超时
	 */
	RESPONSE_504("504", "网关超时"),
	/**
	 * 当前页
	 */
	RESPONSE_PAGE_NUM("1", "当前页"),
	/**
	 * 当前页显示记录数
	 */
	RESPONSE_PAGE_SIZE("20", "当前页显示记录数"),

	/**************************
	 * 定义图片上传响应码--start
	 ***********************************/
	/**
	 * 上传失败，上传图片数据为空
	 */
	RESPONSE_10003("10003", "上传失败，上传图片数据为空"),
	/**
	 * 上传失败，数据不合法
	 */
	RESPONSE_10004("10004", "上传失败，数据不合法"),
	/**
	 * 上传图片格式不合法
	 */
	RESPONSE_10005("10005", "上传图片格式不合法"),
	/**************************
	 * 定义图片上传响应码--end
	 ***********************************/
	/**
	 * 查询结果不存在或返回空(空指针异常处理)
	 */
	RESPONSE_10006("10006", "记录不存在"),

	/**************************** 定义供应商基本的响应码--start ************************/
	/**
	 * 公司编号重复
	 */
	RESPONSE_10007("10007", "公司名称重复"),
	/**
	 * 供应商编号重复
	 */
	RESPONSE_10008("10008", "供应商编号重复"),
	/**
	 * 供应商注册号重复
	 */
	RESPONSE_10009("10009", "供应商注册号重复"),
	/**
	 * 供应商主账号重复
	 */
	RESPONSE_10010("10010", "供应商主账号重复"),
	/**
	 * 纳税人识别码重复
	 */
	RESPONSE_10011("10011", "纳税人识别码重复"),
	/**
	 * 银行账号重复
	 */
	RESPONSE_10012("10012", "银行账号重复"),
	/**
	 * 营业执照存号重复
	 */
	RESPONSE_10013("10013", "营业执照号重复"),
	/**
	 * 组织机构代码重复
	 */
	RESPONSE_10014("10014", "组织机构代码重复"),

	/**
	 * 紧急联系人联系电话重复
	 */
	RESPONSE_10015("10015", "紧急联系人联系电话重复"),
	/**
	 * 紧急联系人公司电话重复
	 */
	RESPONSE_10016("10016", "紧急联系人公司电话重复"),
	/**
	 * 入驻联系人电话重复
	 */
	RESPONSE_10017("10017", "入驻联系人电话重复"),
	/**
	 * 入驻联系人邮箱重复
	 */
	RESPONSE_10018("10018", "入驻联系人邮箱重复"),
	/**
	 * 正常状态的供应商已存在
	 */
	RESPONSE_10019("10019", "正常状态的供应商已存在"),

	/**************************** 定义供应商基本的响应码--end ************************/
	/**
	 * 数据没有被更新
	 */
	RESPONSE_10020("10020", "数据没有被更新"),
	/**
	 * 主键没有传递,更新失败
	 */
	RESPONSE_10021("10021", "主键没有传递,更新失败"),

	/**
	 * 主键没有传递,更新失败
	 */
	RESPONSE_10022("10022", "后台运行异常检查传入审核参数是否符合规范"), RESPONSE_10023("10023", "该商品在该子公司已有配置销售信息"),

	/**
	 * 更新失败
	 */
	RESPONSE_10024("10024", "更新失败"),
	/**
	 * 插入失败
	 */
	RESPONSE_10025("10025", "插入失败"),
	/**
	 * 删除操作失败
	 */
	RESPONSE_10026("10026", "删除操作失败"),
	/**
	 * 没有可处理的商品id
	 */
	RESPONSE_10027("10027", "没有可处理的商品id"),

	/**
	 * 采购内装数必须是默认箱规的整数倍
	 */
	RESPONSE_10028("10028", "采购内装数必须是默认箱规的整数倍"),
	/**
	 * 商品的默认箱规的为零
	 */
	RESPONSE_10029("10029", "商品的默认箱规的为零"),
	/**
	 * 流水号生成失败
	 */
	RESPONSE_10030("10030", "流水号生成失败"),

	/**
	 * 订单校验失败
	 */
	RESPONSE_10031("10031", "订单校验失败"),
	/**
	 * 供应商地址发生改变
	 */
	RESPONSE_10032("10032", "供应商地址已发生改变"),
	/**
	 * 供应商状态异常
	 */
	RESPONSE_10033("10033", "供应商状态异常"),
	/**
	 * 条形码的URL插入失败
	 */
	RESPONSE_10034("10034", "条形码的URL插入失败"),
	/**
	 * 供应商地点编号重复
	 */
	RESPONSE_10035("10035", "供应商地点编号重复"),

	/**
	 * 热搜参数字数超过5个
	 */
	RESPONSE_10036("10036", "参数字数超过5个"),

	/**
	 * 该参数已存在，请重新填写
	 */
	RESPONSE_10037("10037", "该参数已存在，请重新填写"),

	/**
	 * 请输入必填字段
	 */
	RESPONSE_10038("10038", "请输入必填字段"),
	/**
	 * 请输入必填字段
	 */
	RESPONSE_10039("10039", "查询门店信息为空"),

	/**
	 * 请输入必填字段
	 */
	RESPONSE_10040("10040", "商品不支持该区域销售"),
	/**
	 * 库存不足
	 */
	RESPONSE_10041("10041", "库存不足"),
	/**
	 * 用于订单提交的时候提示前端，区别于修改、加入购物车
	 */
	RESPONSE_10042("10042", "库存不足"),
	RESPONSE_10043("10043", "采购价格不能为0"),
	RESPONSE_10044("10044", "该商品不支持在此区域内销售"),
	RESPONSE_10045("10045", "文件不存在"),
	RESPONSE_10046("10046", "该记录已存在"),
	RESPONSE_10047("10047", "上传了一个空文件,请添加数据"),
	RESPONSE_10052("10052", "赠送商品已被抢光啦");
	CommonsEnum(String code, String name) {
		this.code = code;
		this.name = name;
	}

	private String	code;
	private String	name;



	public String getCode() {
		return code;
	}



	public void setCode(String code) {
		this.code = code;
	}



	public String getName() {
		return name;
	}



	public void setName(String name) {
		this.name = name;
	}
}
